prueba.yml
---
execution:
- concurrency: 1000
  hold-for: 10
  ramp-up: 2m
  locations:
    us-east-1: 50
    us-west-1: 50
    eu-west-1: 50
    eu-west-2: 50
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php
      body:
        fromPort: Paris
        toPort: Buenos Aires

modules:
  cloud:
    workspace: 109682
    test: PerfTest
    report-name: PerfTest 1K